sim/rhoReactingCentralFoam/1000_3_adjustable/0/H2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

//internalField   uniform 0.028705;
internalField   uniform 0.02851; // from Marcantoni 


boundaryField
{
	inlet
	{
	    type            zeroGradient;
	}
	top
	{
	    type            zeroGradient;
	}
	bottom
    {
        type            zeroGradient;
    }
	outlet
	{
	    type            inletOutlet;
	    inletValue      uniform 0.0;
	    value           uniform 0.0;
	}
	frontAndBack
	{
	    type            empty;
	}
}


// ************************************************************************* //
