sim/rhoReactingCentralFoam/1000_3_adjustable/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    	inlet
    	{
    	    type            fixedValue;
    	    value           uniform 0;
    	}
    	top
    	{
    	    type            fixedValue;
    	    value           uniform 0;
    	}
	bottom
	{
	    type            fixedValue;
	    value           uniform 0;
	}
	outlet
	{
	    type            zeroGradient;
	}
	frontAndBack
	{
	    type            empty;
	}
}


// ************************************************************************* //
